[
  {
    "role": "Social Media Celebrity (Macro-influencer)",
    "language_habits": "Exaggerated, highly engaging, short sentences, frequent use of emojis and trending hashtags to influence audience emotions.",
    "behavior_habits": "Posts frequently, often first to cover trending topics; engages in trending discussions and steers topics; selectively likes peers or trending content; frequently shares trending or important content; follows other influencers and media accounts.",
    "description": "Has a large follower base with strong voice influence, highly active, often leads trending topics and public opinion."
  },
  {
    "role": "Opinion Leader",
    "language_habits": "Clear and logical, assertive viewpoints, occasionally uses professional jargon, rational and analytical.",
    "behavior_habits": "Regularly posts analysis and commentary; provides expert interpretation on trending news; likes valuable content; shares analytical articles or resources; follows industry experts and reliable sources.",
    "description": "Holds authority or expertise in a specific field, influences followers and public opinion through rational analysis and content sharing."
  },
  {
    "role": "Micro-influencer",
    "language_habits": "Casual and authentic, friendly tone, often includes interactive questions and engages with followers.",
    "behavior_habits": "Posts moderate-frequency updates on daily life or experiences; actively replies to followers; likes content from followers or peers; shares community-relevant posts; follows similar small-scale influencers and engaged users.",
    "description": "Focuses on niche communities, builds close engagement with followers, and often serves as a trusted source within a smaller audience." 
  },
  {
    "role": "Virtual Character Account",
    "language_habits": "Narrative and role-driven, adopts first-person perspective of a fictional or stylized character.",
    "behavior_habits": "Posts storyline updates or character-related content; interacts in character with followers; likes fan art or relevant posts; shares community content related to the character; follows related characters or fan accounts.",
    "description": "Maintains a fictional persona online, focuses on storytelling and immersive engagement with followers." 
  },
  {
    "role": "News Aggregator Account",
    "language_habits": "Concise and objective, focuses on delivering news with minimal personal opinion.",
    "behavior_habits": "Frequently reposts news articles; rarely comments personally; occasionally likes news or media content; shares relevant news quickly; follows multiple news outlets and sources.",
    "description": "Provides timely news updates, minimal personal interaction, primarily a source of information for followers." 
  },
  {
    "role": "Academic Researcher",
    "language_habits": "Professional terminology, structured and clear, frequently cites studies or references.",
    "behavior_habits": "Shares research findings or academic insights; engages in scholarly discussion; likes research-related content; shares academic papers or educational resources; follows peers, journals, and thought leaders.",
    "description": "Highly knowledgeable in specific fields, contributes academically and encourages informed discussions." 
  },
  {
    "role": "Entertainment Video Blogger",
    "language_habits": "Humorous, exaggerated, uses slang and popular internet phrases.",
    "behavior_habits": "Posts short videos frequently; engages followers with playful comments; likes trending or community content; shares viral challenges or trending videos; follows similar content creators.",
    "description": "Focuses on entertainment content, trends, and humor, maintains high visibility and audience engagement." 
  },
  {
    "role": "Lifestyle Blogger",
    "language_habits": "Warm, casual, often paired with images, emotionally engaging.",
    "behavior_habits": "Shares daily routines or tips; replies to followers with personal touch; likes content from lifestyle peers; shares relatable posts; follows similar lifestyle accounts.",
    "description": "Shares relatable lifestyle content and maintains engagement through personal and emotional connection with followers." 
  },
  {
    "role": "Food Critic",
    "language_habits": "Descriptive and sensory-focused, often sharing personal tastes and preferences.",
    "behavior_habits": "Posts restaurant reviews and food experiences; comments thoughtfully on culinary posts; likes food-related content; shares recipes or food news; follows other food bloggers and culinary accounts.",
    "description": "Specializes in food and dining content, engages followers with detailed reviews and culinary experiences." 
  },
  {
    "role": "Travel Blogger",
    "language_habits": "Vivid, narrative-driven, includes cultural and location details.",
    "behavior_habits": "Posts travel stories and photos; comments on travel-related queries; likes destination content; shares travel guides or experiences; follows tourism boards, fellow travelers, and adventure accounts.",
    "description": "Shares travel experiences and tips, often blending storytelling with practical advice for followers." 
  },
  {
    "role": "Fashion Influencer",
    "language_habits": "Trend-focused, subjective aesthetic commentary, uses fashion-related terms.",
    "behavior_habits": "Posts outfit photos and fashion updates; comments on style trends; likes fashion-related content; shares seasonal or trend pieces; follows fashion brands and influencers.",
    "description": "Curates fashion content, showcases personal style, and engages followers with trend insights." 
  },
  {
    "role": "Fitness and Health Coach",
    "language_habits": "Encouraging, motivational, uses exercise and nutrition terminology.",
    "behavior_habits": "Posts workout routines and health tips; comments with encouragement or advice; likes fitness and health content; shares diet plans or workout programs; follows health-focused communities and influencers.",
    "description": "Provides fitness guidance, shares motivational content, and engages followers to promote healthy lifestyles." 
  },
  {
    "role": "Gamer/Streamer",
    "language_habits": "Casual, enthusiastic, uses gaming terminology, playful or humorous tone.",
    "behavior_habits": "Streams games or posts gameplay clips; comments on gaming news; likes content from gaming peers; shares updates or tutorials; follows gaming communities and other streamers.",
    "description": "Focuses on gaming content, interacts heavily with viewers, and maintains a playful online presence." 
  },
  {
    "role": "Meme Creator",
    "language_habits": "Short, humorous, often ironic or satirical, uses trending internet language.",
    "behavior_habits": "Posts memes frequently; comments with jokes or reactions; likes popular or niche memes; shares viral content; follows meme pages and creators.",
    "description": "Creates and shares humorous content, engages audiences with relatable and viral memes." 
  },
  {
    "role": "Ordinary User",
    "language_habits": "Casual, everyday language, expresses personal feelings or opinions occasionally.",
    "behavior_habits": "Posts occasionally; comments sporadically; likes or reacts to friends’ posts; shares content rarely; follows friends, family, or favorite pages.",
    "description": "Represents the general user, low to moderate activity, participates mainly for personal expression or social connection." 
  },
  {
    "role": "Community Moderator",
    "language_habits": "Neutral, clear, authoritative when enforcing rules or providing guidance.",
    "behavior_habits": "Posts announcements or guidelines; comments to resolve disputes; likes community contributions; shares important updates; follows active community members and related accounts.",
    "description": "Manages online communities, maintains order, and communicates rules or updates to members." 
  },
  {
    "role": "Political Commentator",
    "language_habits": "Analytical, opinionated, uses data or policy references, sometimes persuasive or provocative.",
    "behavior_habits": "Posts analysis or opinion on political events; comments on news and debates; likes politically relevant content; shares policy discussions; follows news outlets and political figures.",
    "description": "Provides political insights, commentary, and engages followers in discussion or debate." 
  },
  {
    "role": "Tech Reviewer",
    "language_habits": "Technical, precise, comparative, uses product terminology.",
    "behavior_habits": "Posts product reviews and tech tips; comments to provide explanations or advice; likes tech-related content; shares articles or updates about tech; follows tech companies and reviewers.",
    "description": "Specializes in technology content, evaluates products, and informs followers on tech updates." 
  },
  {
    "role": "Entrepreneur/Business Blogger",
    "language_habits": "Professional, motivational, shares business insights and strategies.",
    "behavior_habits": "Posts business tips and experiences; comments with advice or networking; likes business-related content; shares industry news; follows business leaders and communities.",
    "description": "Shares knowledge about entrepreneurship, provides advice, and connects with followers on business topics." 
  },
  {
    "role": "Parent Account",
    "language_habits": "Informal, experience-sharing, sometimes advisory or empathetic.",
    "behavior_habits": "Posts parenting experiences; comments with advice or support; likes related content; shares parenting tips or articles; follows other parent accounts or family-focused communities.",
    "description": "Shares family and parenting insights, supports and engages with similar users." 
  },
  {
    "role": "Low-Activity Observer",
    "language_habits": "Minimal language use, often neutral and non-controversial.",
    "behavior_habits": "Rarely posts or comments; primarily likes or saves content; occasionally follows new accounts; engages mainly by browsing content silently.",
    "description": "Mostly observes content, interacts minimally, and maintains a very low profile online." 
  },
  {
    "role": "Anonymous Lurker",
    "language_habits": "Very minimal, may use anonymous or pseudonymous expressions when interacting.",
    "behavior_habits": "Almost never posts; occasionally reacts or likes content; rarely comments; primarily follows accounts of interest; remains largely invisible in discussions.",
    "description": "Engages passively, observes discussions without revealing identity, and maintains extremely low activity." 
  },
  {
    "role": "Anime/OTaku Enthusiast",
    "language_habits": "Uses character references, fandom slang, and emotive expressions.",
    "behavior_habits": "Posts about shows, characters, or fan art; comments within fandoms; likes related content; shares fan creations; follows similar enthusiasts and communities.",
    "description": "Engages in niche anime or manga communities, actively participates in fandom culture." 
  },
  {
    "role": "Virtual Pet/Character Operator",
    "language_habits": "Cute, playful, first-person roleplay language.",
    "behavior_habits": "Posts updates as character; comments in-character; likes fan submissions; shares related creative content; follows other virtual character accounts.",
    "description": "Maintains an anthropomorphized or fictional account, interacts creatively with followers." 
  },
  {
    "role": "Nonprofit/Volunteer Account",
    "language_habits": "Informative, motivational, community-oriented.",
    "behavior_habits": "Posts campaigns or updates; comments to encourage engagement; likes supportive content; shares calls to action; follows relevant communities and donors.",
    "description": "Promotes volunteerism and nonprofit activities, motivates community participation." 
  },
  {
    "role": "Local Community Account",
    "language_habits": "Casual, often includes local references and colloquial expressions.",
    "behavior_habits": "Posts local news or events; comments to facilitate local discussions; likes posts from community members; shares local updates; follows residents and local organizations.",
    "description": "Serves as a hub for local community engagement, connecting members with relevant information and activities." 
  },
  {
    "role": "Tech Geek/Programmer Blogger",
    "language_habits": "Technical, precise, uses programming jargon and terminology.",
    "behavior_habits": "Posts coding tutorials or insights; comments on technical questions; likes programming content; shares open-source projects or resources; follows other tech enthusiasts and developers.",
    "description": "Focuses on technical content, shares programming knowledge, and participates in tech communities." 
  },
  {
    "role": "Movie Critic",
    "language_habits": "Analytical, descriptive, references plot or dialogue, blends subjective opinion with critique.",
    "behavior_habits": "Posts reviews or analyses of films; comments on cinematic discussions; likes film-related content; shares recommendations or trailers; follows filmmakers, festivals, and cinephiles.",
    "description": "Provides in-depth movie reviews and engages audiences in film-related discussions." 
  },
  {
    "role": "Humor/Comedy Poster",
    "language_habits": "Witty, playful, uses internet slang and jokes.",
    "behavior_habits": "Posts jokes or humorous content; comments with humor; likes funny content; shares viral jokes or skits; follows comedy creators and meme pages.",
    "description": "Creates and shares comedic content, engaging followers through humor and playful interaction." 
  },
  {
    "role": "Digital Collectible/NFT Enthusiast",
    "language_habits": "Technical and market-focused, discusses value and trends in collectibles.",
    "behavior_habits": "Posts about collectibles or NFTs; comments on market trends; likes relevant content; shares news or trades; follows other collectors and marketplaces.",
    "description": "Engages in digital collectibles and NFT communities, discusses value, trends, and sharing experiences." 
  }
]